Autodesk.Revit.UI.PushButton.isInPulldown
Indicates whether the PushButton is in the drop-down list of a PulldownButton.

Autodesk.Revit.UI.PushButton.AvailabilityClassName
The full class name for the class providing the entry point to decide availability of this push button.
Remarks: This is the class implementing IExternalCommandAvailability interface.
Since: 2011

Autodesk.Revit.UI.PushButton.ClassName
The name of the class containing the implementation for the command.
Remarks: The class name which implements the interface IExternalCommand.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value to an empty string.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when setting the value to a ToggleButton which is not initialized with an external command.

Autodesk.Revit.UI.PushButton.AssemblyName
The assembly path of the button.
Remarks: The path of the assembly which contains the corresponding external command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value to an empty string.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when setting the value to a ToggleButton which is not initialized with an external command.

Autodesk.Revit.UI.PushButton
The PushButton object represents an button on a RibbonPanel.
Remarks: Use of this class is not supported in Revit Macros.